                <!-- тут основний файл шаблона, вигляду магазина  -->
                <?php
                    require_once'inc/header.php';
                ?> 
               <!-- тут ПОЧАТОК контенту верстаємо 3-х колоночний резиновий макет -->
               <div id="contentwraper"><!-- тут ПОЧАТОК контент центральна  колонка-->
                    <div id="content"><!-- тут контент центральна  колонка-->
                    
                    <?php
                        //print_arr($_SESSION);
                    ?>
                    
                        
                    <?php
                        include $view.'.php'; //тут підключаю вигляд,який буде динімічно змінюватись по центрі-середині сайту
                    ?>                                            
                        
                    </div>
               </div><!-- тут КІНЕЦЬ контент центральна  колонка-->
                    <?php
                        //тут підключаю ліву колонку
                        require_once'inc/leftbar.php';
                        
                        //тут підключаю праву колонку
                        require_once'inc/rightbar.php';
                    ?>
               <!-- тут КІНЕЦЬ контенту загальна в результаті 3-х колоночний резиновий макет -->
               <div class="clear"></div>
                <?php
                    //тут підключаю footer підвал
                    require_once'inc/footer.php';
                ?>       
                
        </div>  
    </body><!--закончили с телом документа-->
 </html>